# 数据清洗

In [1]:
import numpy as np
import pandas as pd

缺失数据处理

In [2]:
dates = pd.date_range('20130101', periods=6)
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  1.387917 -0.365296 -1.243674 -0.155312
2013-01-02  0.236005 -1.500016 -0.045557 -0.768367
2013-01-03  0.013884  0.082258  1.629379 -0.491468
2013-01-04  0.243186 -1.496710  0.885177 -1.823922
2013-01-05 -0.795596 -0.743976  1.728989 -1.491497
2013-01-06  0.825204 -2.093127 -0.299370 -1.178829

In [3]:
df < 0

                A      B      C     D
2013-01-01  False   True   True  True
2013-01-02  False   True   True  True
2013-01-03  False  False  False  True
2013-01-04  False   True  False  True
2013-01-05   True   True  False  True
2013-01-06  False   True   True  True

In [4]:
df1 = df[df < 0]
df1

                   A         B         C         D
2013-01-01       NaN -0.365296 -1.243674 -0.155312
2013-01-02       NaN -1.500016 -0.045557 -0.768367
2013-01-03       NaN       NaN       NaN -0.491468
2013-01-04       NaN -1.496710       NaN -1.823922
2013-01-05 -0.795596 -0.743976       NaN -1.491497
2013-01-06       NaN -2.093127 -0.299370 -1.178829

In [5]:
df1.fillna('missing')

                   A         B          C         D
2013-01-01   missing -0.365296   -1.24367 -0.155312
2013-01-02   missing  -1.50002 -0.0455569 -0.768367
2013-01-03   missing   missing    missing -0.491468
2013-01-04   missing  -1.49671    missing -1.823922
2013-01-05 -0.795596 -0.743976    missing -1.491497
2013-01-06   missing  -2.09313   -0.29937 -1.178829

In [6]:
df1.dropna()

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [7]:
print(df1)
pd.isnull(df1)

                   A         B         C         D
2013-01-01       NaN -0.365296 -1.243674 -0.155312
2013-01-02       NaN -1.500016 -0.045557 -0.768367
2013-01-03       NaN       NaN       NaN -0.491468
2013-01-04       NaN -1.496710       NaN -1.823922
2013-01-05 -0.795596 -0.743976       NaN -1.491497
2013-01-06       NaN -2.093127 -0.299370 -1.178829

                A      B      C      D
2013-01-01   True  False  False  False
2013-01-02   True  False  False  False
2013-01-03   True   True   True  False
2013-01-04   True  False   True  False
2013-01-05  False  False   True  False
2013-01-06   True  False  False  False

In [9]:
df1.isnull().sum()

A    5
B    1
C    3
D    0
dtype: int64

处理重复数据

In [2]:
df2 = pd.DataFrame({'data1' : ['a'] * 3 + ['b'] * 3,
                       'data2' : np.random.randint(0, 3, 6)})
df2

  data1  data2
0     a      0
1     a      1
2     a      1
3     b      0
4     b      1
5     b      2

In [4]:
df2.data1.unique()

array(['a', 'b'], dtype=object)

In [12]:
df2.duplicated() # 判断是否有重复

0    False
1     True
2    False
3    False
4    False
5     True
dtype: bool

In [13]:
df2.drop_duplicates()

  data1  data2
0     a      0
2     a      2
3     b      1
4     b      2

In [14]:
df2.drop_duplicates('data1')

  data1  data2
0     a      0
3     b      1

* map函数

In [15]:
ser = pd.Series(np.random.randint(0,10,10))
ser

0    2
1    4
2    4
3    3
4    5
5    9
6    0
7    4
8    5
9    6
dtype: int32

In [18]:
ser.map(lambda x : x ** 2)

0     4
1    16
2    16
3     9
4    25
5    81
6     0
7    16
8    25
9    36
dtype: int64

In [19]:
df1

                   A         B         C         D
2013-01-01       NaN -0.365296 -1.243674 -0.155312
2013-01-02       NaN -1.500016 -0.045557 -0.768367
2013-01-03       NaN       NaN       NaN -0.491468
2013-01-04       NaN -1.496710       NaN -1.823922
2013-01-05 -0.795596 -0.743976       NaN -1.491497
2013-01-06       NaN -2.093127 -0.299370 -1.178829

In [21]:
df1.apply(lambda x : x ** 2,axis=1)   #apply可以按轴方向进行聚合操作，applymap不能进行聚合操作，而是把定义的方法应用的每个元素上面

                   A         B         C         D
2013-01-01       NaN  0.133441  1.546724  0.024122
2013-01-02       NaN  2.250048  0.002075  0.590388
2013-01-03       NaN       NaN       NaN  0.241541
2013-01-04       NaN  2.240142       NaN  3.326693
2013-01-05  0.632973  0.553500       NaN  2.224562
2013-01-06       NaN  4.381182  0.089622  1.389638

In [26]:
df1.apply(lambda x : x ** 2)

                   A         B         C         D
2013-01-01       NaN  0.133441  1.546724  0.024122
2013-01-02       NaN  2.250048  0.002075  0.590388
2013-01-03       NaN       NaN       NaN  0.241541
2013-01-04       NaN  2.240142       NaN  3.326693
2013-01-05  0.632973  0.553500       NaN  2.224562
2013-01-06       NaN  4.381182  0.089622  1.389638

In [24]:
df1.A.map(lambda x : x ** 2)

2013-01-01         NaN
2013-01-02         NaN
2013-01-03         NaN
2013-01-04         NaN
2013-01-05    0.632973
2013-01-06         NaN
Freq: D, Name: A, dtype: float64

* 数据替换repalce

In [28]:
# 替换单个值
print(ser)
ser.replace(4, -100)

0    2
1    4
2    4
3    3
4    5
5    9
6    0
7    4
8    5
9    6
dtype: int32

0      2
1   -100
2   -100
3      3
4      5
5      9
6      0
7   -100
8      5
9      6
dtype: int32

In [29]:
# 替换多个值
print(ser)
ser.replace([4, 9], -100)

0    2
1    4
2    4
3    3
4    5
5    9
6    0
7    4
8    5
9    6
dtype: int32

0      2
1   -100
2   -100
3      3
4      5
5   -100
6      0
7   -100
8      5
9      6
dtype: int32

In [31]:
# 替换多个值
print(ser)
ser.replace([6, 9], [-100, -200])

0    2
1    4
2    4
3    3
4    5
5    9
6    0
7    4
8    5
9    6
dtype: int32

0      2
1      4
2      4
3      3
4      5
5   -200
6      0
7      4
8      5
9   -100
dtype: int64